zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_PCI_HDR_TYPE0.h
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_P2P_REQ_REDIR_EN_MASK (0x4U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_P2P_REQ_REDIR_EN_SHIFT (2U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_P2P_REQ_REDIR_EN_WIDTH (1U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_P2P_REQ_REDIR_EN(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_P2P_REQ_REDIR_EN_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_P2P_REQ_REDIR_EN_MASK)

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_DIR_TRANS_P2P_EN_MASK (0x40U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_DIR_TRANS_P2P_EN_SHIFT (6U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_DIR_TRANS_P2P_EN_WIDTH (1U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_DIR_TRANS_P2P_EN(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_DIR_TRANS_P2P_EN_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_DIR_TRANS_P2P_EN_MASK)
/*! @} */

/*! @name PCIE_CFC_RTR_CAP_HDR - PCIe readiness time reporting capability header */
/*! @{ */

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_PCIE_EXT_CAP_ID_MASK (0xFFFFU)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_PCIE_EXT_CAP_ID_SHIFT (0U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_PCIE_EXT_CAP_ID_WIDTH (16U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_PCIE_EXT_CAP_ID(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_PCIE_EXT_CAP_ID_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_PCIE_EXT_CAP_ID_MASK)

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_CAP_VER_MASK (0xF0000U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_CAP_VER_SHIFT (16U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_CAP_VER_WIDTH (4U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_CAP_VER(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_CAP_VER_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_CAP_VER_MASK)

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_NEXT_CAP_OFF_MASK (0xFFF00000U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_NEXT_CAP_OFF_SHIFT (20U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_NEXT_CAP_OFF_WIDTH (12U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_NEXT_CAP_OFF(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_NEXT_CAP_OFF_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_NEXT_CAP_OFF_MASK)
/*! @} */

/*! @name PCIE_CFC_RTR_RTR1 - PCIe RTR readiness time reporting 1 register */
/*! @{ */

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR1_RESET_TIME_MASK (0xFFFU)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR1_RESET_TIME_SHIFT (0U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR1_RESET_TIME_WIDTH (12U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR1_RESET_TIME(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR1_RESET_TIME_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR1_RESET_TIME_MASK)

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR1_VALID_MASK (0x80000000U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR1_VALID_SHIFT (31U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR1_VALID_WIDTH (1U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR1_VALID(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR1_VALID_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR1_VALID_MASK)
/*! @} */

/*! @name PCIE_CFC_RTR_RTR2 - PCIe RTR readiness time reporting 2 register */
/*! @{ */

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR2_FLR_TIME_MASK (0xFFFU)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR2_FLR_TIME_SHIFT (0U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR2_FLR_TIME_WIDTH (12U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR2_FLR_TIME(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR2_FLR_TIME_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR2_FLR_TIME_MASK)

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR2_D3HOT_D0_TIME_MASK (0xFFF000U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR2_D3HOT_D0_TIME_SHIFT (12U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR2_D3HOT_D0_TIME_WIDTH (12U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR2_D3HOT_D0_TIME(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR2_D3HOT_D0_TIME_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR2_D3HOT_D0_TIME_MASK)
/*! @} */

/*! @name PCIE_CFC_SRIOV_CAP_HDR - PCIe SR-IOV capability header */
/*! @{ */

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_PCIE_EXT_CAP_ID_MASK (0xFFFFU)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_PCIE_EXT_CAP_ID_SHIFT (0U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_PCIE_EXT_CAP_ID_WIDTH (16U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_PCIE_EXT_CAP_ID(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_PCIE_EXT_CAP_ID_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_PCIE_EXT_CAP_ID_MASK)

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_CAP_VER_MASK (0xF0000U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_CAP_VER_SHIFT (16U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_CAP_VER_WIDTH (4U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_CAP_VER(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_CAP_VER_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_CAP_VER_MASK)

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_NEXT_CAP_OFF_MASK (0xFFF00000U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_NEXT_CAP_OFF_SHIFT (20U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_NEXT_CAP_OFF_WIDTH (12U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_NEXT_CAP_OFF(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_NEXT_CAP_OFF_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_HDR_NEXT_CAP_OFF_MASK)
/*! @} */

/*! @name PCIE_CFC_SRIOV_CAP - PCIe SR-IOV capability register */
/*! @{ */

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_VF_MIGRATION_CAP_MASK (0x1U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_VF_MIGRATION_CAP_SHIFT (0U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_VF_MIGRATION_CAP_WIDTH (1U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_VF_MIGRATION_CAP(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_VF_MIGRATION_CAP_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_VF_MIGRATION_CAP_MASK)

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_ARI_CAP_HIER_PRSV_MASK (0x2U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_ARI_CAP_HIER_PRSV_SHIFT (1U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_ARI_CAP_HIER_PRSV_WIDTH (1U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_ARI_CAP_HIER_PRSV(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_ARI_CAP_HIER_PRSV_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_ARI_CAP_HIER_PRSV_MASK)

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_VF_MIGRATION_ING_MSG_NUM_MASK (0xFFE00000U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_VF_MIGRATION_ING_MSG_NUM_SHIFT (21U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_VF_MIGRATION_ING_MSG_NUM_WIDTH (11U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_VF_MIGRATION_ING_MSG_NUM(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_VF_MIGRATION_ING_MSG_NUM_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CAP_VF_MIGRATION_ING_MSG_NUM_MASK)
/*! @} */

/*! @name PCIE_CFC_SRIOV_CTL - PCIe SR-IOV control register */
/*! @{ */

