zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_PCI_HDR_TYPE0.h
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_VF_ENABLE_MASK (0x1U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_VF_ENABLE_SHIFT (0U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_VF_ENABLE_WIDTH (1U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_VF_ENABLE(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_VF_ENABLE_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_VF_ENABLE_MASK)

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MIGRATION_ENABLE_MASK (0x2U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MIGRATION_ENABLE_SHIFT (1U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MIGRATION_ENABLE_WIDTH (1U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MIGRATION_ENABLE(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MIGRATION_ENABLE_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MIGRATION_ENABLE_MASK)

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MIGRATION_INT_ENABLE_MASK (0x4U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MIGRATION_INT_ENABLE_SHIFT (2U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MIGRATION_INT_ENABLE_WIDTH (1U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MIGRATION_INT_ENABLE(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MIGRATION_INT_ENABLE_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MIGRATION_INT_ENABLE_MASK)

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MSE_MASK (0x8U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MSE_SHIFT (3U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MSE_WIDTH (1U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MSE(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MSE_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MSE_MASK)

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_ARI_CAP_HIERARCHY_MASK (0x10U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_ARI_CAP_HIERARCHY_SHIFT (4U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_ARI_CAP_HIERARCHY_WIDTH (1U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_ARI_CAP_HIERARCHY(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_ARI_CAP_HIERARCHY_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_ARI_CAP_HIERARCHY_MASK)

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_D2_SUPPORT_MASK (0x400U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_D2_SUPPORT_SHIFT (10U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_D2_SUPPORT_WIDTH (1U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_D2_SUPPORT(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_D2_SUPPORT_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_D2_SUPPORT_MASK)

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_PME_SUPPORT_MASK (0xF800U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_PME_SUPPORT_SHIFT (11U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_PME_SUPPORT_WIDTH (5U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_PME_SUPPORT(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_PME_SUPPORT_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_CTL_PME_SUPPORT_MASK)
/*! @} */

/*! @name PCIE_CFC_SRIOV_STAT - PCIe SR-IOV status register */
/*! @{ */

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_STAT_VF_MIGRATION_STATUS_MASK (0x1U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_STAT_VF_MIGRATION_STATUS_SHIFT (0U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_STAT_VF_MIGRATION_STATUS_WIDTH (1U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_STAT_VF_MIGRATION_STATUS(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_STAT_VF_MIGRATION_STATUS_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_STAT_VF_MIGRATION_STATUS_MASK)
/*! @} */

/*! @name PCIE_CFC_SRIOV_INIT_VFS - PCIe SR-IOV initial VFs register */
/*! @{ */

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_INIT_VFS_INITIAL_VFS_MASK (0xFFFFU)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_INIT_VFS_INITIAL_VFS_SHIFT (0U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_INIT_VFS_INITIAL_VFS_WIDTH (16U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_INIT_VFS_INITIAL_VFS(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_INIT_VFS_INITIAL_VFS_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_INIT_VFS_INITIAL_VFS_MASK)
/*! @} */

/*! @name PCIE_CFC_SRIOV_TOTAL_VFS - PCIe SR-IOV total VFs register */
/*! @{ */

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_TOTAL_VFS_TOTAL_VFS_MASK (0xFFFFU)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_TOTAL_VFS_TOTAL_VFS_SHIFT (0U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_TOTAL_VFS_TOTAL_VFS_WIDTH (16U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_TOTAL_VFS_TOTAL_VFS(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_TOTAL_VFS_TOTAL_VFS_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_TOTAL_VFS_TOTAL_VFS_MASK)
/*! @} */

/*! @name PCIE_CFC_SRIOV_NUM_VFS - PCIe SR-IOV num VFs register */
/*! @{ */

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_NUM_VFS_NUM_VFS_MASK (0xFFFFU)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_NUM_VFS_NUM_VFS_SHIFT (0U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_NUM_VFS_NUM_VFS_WIDTH (16U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_NUM_VFS_NUM_VFS(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_NUM_VFS_NUM_VFS_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_NUM_VFS_NUM_VFS_MASK)
/*! @} */

/*! @name PCIE_CFC_SRIOV_FUNC_DEP_LIST - PCIe SR-IOV function dependency list register */
/*! @{ */

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_FUNC_DEP_LIST_FUNC_DEP_LIST_MASK (0xFFFFU)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_FUNC_DEP_LIST_FUNC_DEP_LIST_SHIFT (0U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_FUNC_DEP_LIST_FUNC_DEP_LIST_WIDTH (16U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_FUNC_DEP_LIST_FUNC_DEP_LIST(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_FUNC_DEP_LIST_FUNC_DEP_LIST_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_FUNC_DEP_LIST_FUNC_DEP_LIST_MASK)
/*! @} */

/*! @name PCIE_CFC_SRIOV_FIRST_VF_OFF - PCIe SR-IOV first VF offset register */
/*! @{ */

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_FIRST_VF_OFF_FIRST_VF_OFFSET_MASK (0xFFFFU)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_FIRST_VF_OFF_FIRST_VF_OFFSET_SHIFT (0U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_FIRST_VF_OFF_FIRST_VF_OFFSET_WIDTH (16U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_FIRST_VF_OFF_FIRST_VF_OFFSET(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_FIRST_VF_OFF_FIRST_VF_OFFSET_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_FIRST_VF_OFF_FIRST_VF_OFFSET_MASK)
/*! @} */

