zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_PCI_HDR_TYPE0.h
/*! @name PCIE_CFC_SRIOV_VF_STRIDE - PCIe SR-IOV VF stride register */
/*! @{ */

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_VF_STRIDE_VF_STRIDE_MASK (0xFFFFU)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_VF_STRIDE_VF_STRIDE_SHIFT (0U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_VF_STRIDE_VF_STRIDE_WIDTH (16U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_VF_STRIDE_VF_STRIDE(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_VF_STRIDE_VF_STRIDE_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_VF_STRIDE_VF_STRIDE_MASK)
/*! @} */

/*! @name PCIE_CFC_SRIOV_VF_DEV_ID - PCIe SR-IOV VF device ID register */
/*! @{ */

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_VF_DEV_ID_VF_DEVICE_ID_MASK (0xFFFFU)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_VF_DEV_ID_VF_DEVICE_ID_SHIFT (0U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_VF_DEV_ID_VF_DEVICE_ID_WIDTH (16U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_VF_DEV_ID_VF_DEVICE_ID(x) (((uint16_t)(((uint16_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_VF_DEV_ID_VF_DEVICE_ID_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_VF_DEV_ID_VF_DEVICE_ID_MASK)
/*! @} */

/*! @name PCIE_CFC_SRIOV_SUP_PAGE_SIZES - PCIe SR-IOV supported page sizes ID register */
/*! @{ */

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_SUP_PAGE_SIZES_SUP_PAGE_SIZES_MASK (0xFFFFFFFFU)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_SUP_PAGE_SIZES_SUP_PAGE_SIZES_SHIFT (0U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_SUP_PAGE_SIZES_SUP_PAGE_SIZES_WIDTH (32U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_SUP_PAGE_SIZES_SUP_PAGE_SIZES(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_SUP_PAGE_SIZES_SUP_PAGE_SIZES_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_SUP_PAGE_SIZES_SUP_PAGE_SIZES_MASK)
/*! @} */

/*! @name PCIE_CFC_SRIOV_SYS_PAGE_SIZE - PCIe SR-IOV system page size ID register */
/*! @{ */

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_SYS_PAGE_SIZE_SYS_PAGE_SIZE_MASK (0xFFFFFFFFU)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_SYS_PAGE_SIZE_SYS_PAGE_SIZE_SHIFT (0U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_SYS_PAGE_SIZE_SYS_PAGE_SIZE_WIDTH (32U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_SYS_PAGE_SIZE_SYS_PAGE_SIZE(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_SYS_PAGE_SIZE_SYS_PAGE_SIZE_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_SYS_PAGE_SIZE_SYS_PAGE_SIZE_MASK)
/*! @} */

/*! @name PCIE_CFC_VF_BAR - PCIe SR-IOV VF base address register 0..PCIe SR-IOV VF base address register 5 */
/*! @{ */

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_VF_BAR_MEM_IO_IND_MASK (0x1U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_VF_BAR_MEM_IO_IND_SHIFT (0U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_VF_BAR_MEM_IO_IND_WIDTH (1U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_VF_BAR_MEM_IO_IND(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_VF_BAR_MEM_IO_IND_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_VF_BAR_MEM_IO_IND_MASK)

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_VF_BAR_MEM_TYPE_MASK (0x6U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_VF_BAR_MEM_TYPE_SHIFT (1U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_VF_BAR_MEM_TYPE_WIDTH (2U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_VF_BAR_MEM_TYPE(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_VF_BAR_MEM_TYPE_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_VF_BAR_MEM_TYPE_MASK)

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_VF_BAR_PF_MEM_MASK (0x8U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_VF_BAR_PF_MEM_SHIFT (3U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_VF_BAR_PF_MEM_WIDTH (1U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_VF_BAR_PF_MEM(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_VF_BAR_PF_MEM_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_VF_BAR_PF_MEM_MASK)

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_VF_BAR_ADDR_MASK (0xFFFFFFF0U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_VF_BAR_ADDR_SHIFT (4U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_VF_BAR_ADDR_WIDTH (28U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_VF_BAR_ADDR(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_VF_BAR_ADDR_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_VF_BAR_ADDR_MASK)
/*! @} */

/*! @name PCIE_CFC_SRIOV_VF_MIG_STATE_ARR_OFF - PCIe SR-IOV VF migration state array offset register */
/*! @{ */

#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_VF_MIG_STATE_ARR_OFF_VF_MIG_STATE_ARR_OFF_MASK (0xFFFFFFFFU)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_VF_MIG_STATE_ARR_OFF_VF_MIG_STATE_ARR_OFF_SHIFT (0U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_VF_MIG_STATE_ARR_OFF_VF_MIG_STATE_ARR_OFF_WIDTH (32U)
#define ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_VF_MIG_STATE_ARR_OFF_VF_MIG_STATE_ARR_OFF(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_VF_MIG_STATE_ARR_OFF_VF_MIG_STATE_ARR_OFF_SHIFT)) & ENETC_PCI_HDR_TYPE0_PCIE_CFC_SRIOV_VF_MIG_STATE_ARR_OFF_VF_MIG_STATE_ARR_OFF_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group ENETC_PCI_HDR_TYPE0_Register_Masks */

/*!
 * @}
 */ /* end of group ENETC_PCI_HDR_TYPE0_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_ENETC_PCI_HDR_TYPE0_H_) */
